{
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_3",
        "layers": [
          {
            "name": "input_4",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 128, 128, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_4"
            },
            "inbound_nodes": []
          },
          {
            "name": "conv2d_69",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_69",
              "trainable": true,
              "dtype": "float32",
              "filters": 8,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["input_4", 0, 0, {}]]]
          },
          {
            "name": "conv2d_70",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_70",
              "trainable": true,
              "dtype": "float32",
              "filters": 8,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_69", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_15",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_15",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["conv2d_70", 0, 0, {}]]]
          },
          {
            "name": "conv2d_71",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_71",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_15", 0, 0, {}]]]
          },
          {
            "name": "conv2d_72",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_72",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_71", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_16",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_16",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["conv2d_72", 0, 0, {}]]]
          },
          {
            "name": "conv2d_73",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_73",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_16", 0, 0, {}]]]
          },
          {
            "name": "conv2d_74",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_74",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_73", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_17",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_17",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["conv2d_74", 0, 0, {}]]]
          },
          {
            "name": "conv2d_75",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_75",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]]
          },
          {
            "name": "conv2d_76",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_76",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_75", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_18",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_18",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["conv2d_76", 0, 0, {}]]]
          },
          {
            "name": "conv2d_77",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_77",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]]
          },
          {
            "name": "conv2d_78",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_78",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_77", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_19",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_19",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["conv2d_78", 0, 0, {}]]]
          },
          {
            "name": "conv2d_79",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_79",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}]]]
          },
          {
            "name": "conv2d_80",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_80",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_79", 0, 0, {}]]]
          },
          {
            "name": "conv2d_transpose_15",
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "conv2d_transpose_15",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [2, 2],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            },
            "inbound_nodes": [[["conv2d_80", 0, 0, {}]]]
          },
          {
            "name": "concatenate_15",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_15",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "inbound_nodes": [
              [
                ["conv2d_transpose_15", 0, 0, {}],
                ["conv2d_78", 0, 0, {}]
              ]
            ]
          },
          {
            "name": "conv2d_81",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_81",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]
          },
          {
            "name": "conv2d_82",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_82",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_81", 0, 0, {}]]]
          },
          {
            "name": "conv2d_transpose_16",
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "conv2d_transpose_16",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [2, 2],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            },
            "inbound_nodes": [[["conv2d_82", 0, 0, {}]]]
          },
          {
            "name": "concatenate_16",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_16",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "inbound_nodes": [
              [
                ["conv2d_transpose_16", 0, 0, {}],
                ["conv2d_76", 0, 0, {}]
              ]
            ]
          },
          {
            "name": "conv2d_83",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_83",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]
          },
          {
            "name": "conv2d_84",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_84",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_83", 0, 0, {}]]]
          },
          {
            "name": "conv2d_transpose_17",
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "conv2d_transpose_17",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [2, 2],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            },
            "inbound_nodes": [[["conv2d_84", 0, 0, {}]]]
          },
          {
            "name": "concatenate_17",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_17",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "inbound_nodes": [
              [
                ["conv2d_transpose_17", 0, 0, {}],
                ["conv2d_74", 0, 0, {}]
              ]
            ]
          },
          {
            "name": "conv2d_85",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_85",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]
          },
          {
            "name": "conv2d_86",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_86",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_85", 0, 0, {}]]]
          },
          {
            "name": "conv2d_transpose_18",
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "conv2d_transpose_18",
              "trainable": true,
              "dtype": "float32",
              "filters": 8,
              "kernel_size": [2, 2],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            },
            "inbound_nodes": [[["conv2d_86", 0, 0, {}]]]
          },
          {
            "name": "concatenate_18",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_18",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "inbound_nodes": [
              [
                ["conv2d_transpose_18", 0, 0, {}],
                ["conv2d_72", 0, 0, {}]
              ]
            ]
          },
          {
            "name": "conv2d_87",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_87",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]
          },
          {
            "name": "conv2d_88",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_88",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_87", 0, 0, {}]]]
          },
          {
            "name": "conv2d_transpose_19",
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "conv2d_transpose_19",
              "trainable": true,
              "dtype": "float32",
              "filters": 4,
              "kernel_size": [2, 2],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            },
            "inbound_nodes": [[["conv2d_88", 0, 0, {}]]]
          },
          {
            "name": "concatenate_19",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_19",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "inbound_nodes": [
              [
                ["conv2d_transpose_19", 0, 0, {}],
                ["conv2d_70", 0, 0, {}]
              ]
            ]
          },
          {
            "name": "conv2d_89",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_89",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["concatenate_19", 0, 0, {}]]]
          },
          {
            "name": "conv2d_90",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_90",
              "trainable": true,
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_89", 0, 0, {}]]]
          },
          {
            "name": "conv2d_91",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_91",
              "trainable": true,
              "dtype": "float32",
              "filters": 1,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["conv2d_90", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_4", 0, 0]],
        "output_layers": [["conv2d_91", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of2", "group1-shard2of2"],
      "weights": [
        {
          "name": "conv2d_69/kernel",
          "shape": [3, 3, 3, 8],
          "dtype": "float32"
        },
        {
          "name": "conv2d_69/bias",
          "shape": [8],
          "dtype": "float32"
        },
        {
          "name": "conv2d_70/kernel",
          "shape": [3, 3, 8, 8],
          "dtype": "float32"
        },
        {
          "name": "conv2d_70/bias",
          "shape": [8],
          "dtype": "float32"
        },
        {
          "name": "conv2d_71/kernel",
          "shape": [3, 3, 8, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_71/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_72/kernel",
          "shape": [3, 3, 16, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_72/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_73/kernel",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_73/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_74/kernel",
          "shape": [3, 3, 32, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_74/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_75/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_75/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_76/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_76/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_77/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_77/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_78/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_78/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_79/kernel",
          "shape": [3, 3, 128, 256],
          "dtype": "float32"
        },
        {
          "name": "conv2d_79/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "conv2d_80/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        {
          "name": "conv2d_80/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "conv2d_81/kernel",
          "shape": [3, 3, 192, 128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_81/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_82/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_82/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_83/kernel",
          "shape": [3, 3, 96, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_83/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_84/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_84/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_85/kernel",
          "shape": [3, 3, 48, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_85/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_86/kernel",
          "shape": [3, 3, 32, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_86/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_87/kernel",
          "shape": [3, 3, 24, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_87/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_88/kernel",
          "shape": [3, 3, 16, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_88/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_89/kernel",
          "shape": [3, 3, 12, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_89/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_90/kernel",
          "shape": [3, 3, 16, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_90/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_91/kernel",
          "shape": [1, 1, 16, 1],
          "dtype": "float32"
        },
        {
          "name": "conv2d_91/bias",
          "shape": [1],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_15/kernel",
          "shape": [2, 2, 64, 256],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_15/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_16/kernel",
          "shape": [2, 2, 32, 128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_16/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_17/kernel",
          "shape": [2, 2, 16, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_17/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_18/kernel",
          "shape": [2, 2, 8, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_18/bias",
          "shape": [8],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_19/kernel",
          "shape": [2, 2, 4, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_19/bias",
          "shape": [4],
          "dtype": "float32"
        }
      ]
    }
  ]
}
